const carTypes = [
    { label: "Том оврын жийп", value: "Том оврын жийп", },
    { label: "Дунд оврын жийп", value: "Дунд оврын жийп" },
    { label: "Жижиг тэрэг", value: "Жижиг тэрэг" },
    { label: "Портер", value: "Портер" },
    { label: "Том ачааны машин", value: "Том ачааны машин" },
    { label: "Жижиг трактор", value: "Жижиг трактор" },
    { label: "Том трактор", value: "Том трактор" },
    { label: "Мотоцикл", value: "Мотоцикл" },
    { label: "Автобус", value: "Автобус" },
    { label: "Микро", value: "Микро" },
  ];

  const washTypes = [
    { label: "Энгийн гадна угаалга", value: "Энгийн гадна угаалга", },
    { label: "Энгийн дотор угаалга", value: "Энгийн дотор угаалга" },
    { label: "Энгийн бүтэн угаалга", value: "Энгийн бүтэн угаалга" },
    { label: "Уурийн угаалга", value: "Уурийн угаалга" },
    { label: "VIP угаалга", value: "VIP угаалга" },
    { label: "Суудал угаалга", value: "Суудал угаалга" },
    { label: "Шал тааз угаалга", value: "Шал тааз угаалга" },
    { label: "Мотор шүрших", value: "Мотор шүрших" },
    { label: "Мотор угаалга", value: "Мотор угаалга" },
    { label: "Дрилл өнгөлгөө", value: "Дрилл өнгөлгөө" },
  ];

  const provinces = [
    { label: "Улаанбаатар", value: "Улаанбаатар" },
    { label: "Дархан-Уул", value: "Дархан-Уул" },
    { label: "Сэлэнгэ", value: "Сэлэнгэ" },
  ];

  const districtsByProvince = {
    "Улаанбаатар": [
      { label: "Багануур", value: "Багануур" },
      { label: "Багахангай", value: "Багахангай" },
      { label: "Баянгол", value: "Баянгол" },
      { label: "Баянзүрх", value: "Баянзүрх" },
      { label: "Налайх", value: "Налайх" },
      { label: "Сүхбаатар", value: "Сүхбаатар" },
      { label: "Сонгинохайрхан", value: "Сонгинохайрхан" },
      { label: "Хан-Уул", value: "Хан-Уул" },
      { label: "Чингэлтэй", value: "Чингэлтэй" },
    ],
    "Дархан-Уул": [
      { label: "Дархан", value: "Дархан" },
      { label: "Орхон", value: "Орхон" },
      { label: "Хонгор", value: "Хонгор" },
      { label: "Шарын гол", value: "Шарын гол" },
    ],
    "Сэлэнгэ": [
      { label: "Алтанбулаг", value: "Алтанбулаг" },
      { label: "Баянгол", value: "Баянгол" },
      { label: "Баруунбүрэн", value: "Баруунбүрэн" },
      { label: "Ерөө", value: "Ерөө" },
      { label: "Жавхлант", value: "Жавхлант" },
      { label: "Зүүнбүрэн", value: "Зүүнбүрэн" },
      { label: "Мандал", value: "Мандал" },
      { label: "Орхон", value: "Орхон" },
      { label: "Орхонтуул", value: "Орхонтуул" },
      { label: "Сант", value: "Сант" },
      { label: "Сайхан", value: "Сайхан" },
      { label: "Сүхбаатар", value: "Сүхбаатар" },
      { label: "Хушаат", value: "Хушаат" },
      { label: "Хүдэр", value: "Хүдэр" },
      { label: "Түшиг", value: "Түшиг" },
      { label: "Цагааннуур", value: "Цагааннуур" },
      { label: "Шаамар", value: "Шаамар" },
    ],
  };
